<img src="https://pandas.pydata.org/static/img/pandas.svg" width="250">

## <center> Intro to Dataframes

In [1]:
import pandas as pd

In [2]:
scores = {"name":['Ray','Japhy','Zosa'],
          "city":['San Francisco','San Francisco','Denver'],
          "score":[75,92,94]
         }

In [3]:
df = pd.DataFrame(scores)

In [4]:
df

    name           city  score
0    Ray  San Francisco     75
1  Japhy  San Francisco     92
2   Zosa         Denver     94

In [5]:
df['score']

0    75
1    92
2    94
Name: score, dtype: int64

In [6]:
df['name_city'] = df['name'] + '_' + df['city']

In [7]:
df[df['score']>90]

    name           city  score            name_city
1  Japhy  San Francisco     92  Japhy_San Francisco
2   Zosa         Denver     94          Zosa_Denver

In [8]:
df

    name           city  score            name_city
0    Ray  San Francisco     75    Ray_San Francisco
1  Japhy  San Francisco     92  Japhy_San Francisco
2   Zosa         Denver     94          Zosa_Denver

In [12]:
df[df['name_city'] == "Ray_San Francisco"]

  name           city  score          name_city
0  Ray  San Francisco     75  Ray_San Francisco